bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_adc.c
    tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, GLB_GPADC_MICBIAS_EN, adc_mic_config->micBiasEn);

    BL_WR_REG(GLB_BASE, GLB_GPADC_REG_CMD, tmpVal1);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  ADC MIC bias control
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void ADC_MIC_Bias_Enable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_GPADC_REG_CMD);
    tmpVal = BL_SET_REG_BIT(tmpVal, GLB_GPADC_MICBIAS_EN);
    BL_WR_REG(GLB_BASE, GLB_GPADC_REG_CMD, tmpVal);
}

/****************************************************************************/ /**
 * @brief  ADC MIC bias control
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void ADC_MIC_Bias_Disable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_GPADC_REG_CMD);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_GPADC_MICBIAS_EN);
    BL_WR_REG(GLB_BASE, GLB_GPADC_REG_CMD, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Trim ADC Gain
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION ADC_Gain_Trim(void)
{
    Efuse_Common_Trim_Type trim;
    uint32_t tmp;

    EF_Ctrl_Read_Common_Trim("gpadc_gain", &trim);

    if (trim.en) {
        if (trim.parity == EF_Ctrl_Get_Trim_Parity(trim.value, trim.len)) {
            adcGainCoeffCal.adcGainCoeffEnable = ENABLE;
            adcGainCoeffCal.adcgainCoeffVal = trim.value;
            tmp = adcGainCoeffCal.adcgainCoeffVal;

            if (tmp & 0x800) {
                tmp = ~tmp;
                tmp += 1;
                tmp = tmp & 0xfff;
                //printf("val==%08x\r\n",(unsigned int)tmp);
                adcGainCoeffCal.coe = (1.0 + ((float)tmp / 2048.0));
                //printf("coe==%0f\r\n",adcGainCoeffCal.coe);
            } else {
                adcGainCoeffCal.coe = (1.0 - ((float)tmp / 2048.0));
                //printf("coe==%0f\r\n",adcGainCoeffCal.coe);
            }

            return SUCCESS;
        }
    }

    return ERROR;
}

/*@} end of group ADC_Public_Functions */

/*@} end of group ADC */

/*@} end of group BL702L_Peripheral_Driver */
